I just tried with master (64de0bb68fde35178b2a2f23db38da6ad7a5212e) and it seems to work:


```
➜  terraform-provider-consul git:(master) ✗ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # consul_service.redis will be created
  + resource "consul_service" "redis" {
      + address    = (known after apply)
      + datacenter = (known after apply)
      + id         = (known after apply)
      + name       = "redis"
      + node       = "MacBook-Pro-de-Remi.local"
      + port       = 6379
      + service_id = (known after apply)

      + check {
          + check_id                          = (known after apply)
          + deregister_critical_service_after = "30s"
          + interval                          = "5s"
          + method                            = "GET"
          + name                              = "Redis health check"
          + status                            = "critical"
          + timeout                           = "1s"
          + tls_skip_verify                   = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

consul_service.redis: Creating...
consul_service.redis: Creation complete after 0s [id=redis]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
➜  terraform-provider-consul git:(master) ✗ terraform apply
consul_service.redis: Refreshing state... [id=redis]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # consul_service.redis will be created
  + resource "consul_service" "redis" {
      + address    = (known after apply)
      + datacenter = (known after apply)
      + id         = (known after apply)
      + name       = "redis"
      + node       = "MacBook-Pro-de-Remi.local"
      + port       = 6379
      + service_id = (known after apply)

      + check {
          + check_id                          = (known after apply)
          + deregister_critical_service_after = "30s"
          + interval                          = "5s"
          + method                            = "GET"
          + name                              = "Redis health check"
          + status                            = "critical"
          + timeout                           = "1s"
          + tls_skip_verify                   = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

consul_service.redis: Creating...
consul_service.redis: Creation complete after 0s [id=redis]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
➜  terraform-provider-consul git:(master) ✗ g rev-parse HEAD
64de0bb68fde35178b2a2f23db38da6ad7a5212e
```

Did I miss something to reproduce the issue? We used to have a bug like this but it's supposed to have been solved in 194fff3da96f712902c9dfdcb6e8ea9a354bcc37.